/* Used when showing an invalid entry or input encountered when expecting a formal entry such as a number of date */
"\\U201c%@\\U201d" = "“%@”";

/* NSKeyValueValidationError, message shown when the numeric value of user input is invalid (for example too small or too large) */
"Err1024-C" = "The value is invalid.";

/* NSKeyValueValidationError, message shown when the numeric value of user input is invalid (for example too small or too large) */
"Err1024-C.a" = "The value %@ is invalid.";

/* NSKeyValueValidationError, suggestion string when a numeric value of an user input is invalid (for example too small or too large) */
"Err1024-R" = "Please provide a valid value.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-C" = "The value is invalid.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-C.a" = "The value %@ is invalid.";

/* NSFormattingError, message shown when the numeric value of an entry or input is too small */
"Err2048-C.an" = "The value is too small.";

/* NSFormattingError, message shown when the numeric value of an entry or input is too large */
"Err2048-C.ax" = "The value is too large.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-R" = "Please provide a valid value.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too small */
"Err2048-R.n" = "Please provide a number no less than %@.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too small or too large */
"Err2048-R.nx" = "Please provide a number between %1$@ and %2$@.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too large */
"Err2048-R.x" = "Please provide a number no greater than %@.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048.an" = "The value %@ is too small.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048.ax" = "The value %@ is too large.";

/* NSFileLockingError */
"Err255-C" = "The file couldn’t be locked.";

/* NSFileLockingError */
"Err255-R" = "The file might already be locked, or you may not have permission to lock it.";

/* NSFileLockingError, argument is a file name */
"Err255.f" = "The file “%@” couldn’t be locked.";

/* NSFileReadUnknownError */
"Err256" = "The file couldn’t be opened.";

/* NSFileReadUnknownError, argument is a file name */
"Err256.f" = "The file “%@” couldn’t be opened.";

/* NSFileReadNoPermissionError */
"Err257" = "The file couldn’t be opened because you don’t have permission to view it.";

/* NSFileReadNoPermissionError */
"Err257-C" = "You don’t have permission.";

/* NSFileReadNoPermissionError; ; suggestion applies to files or folders, hence the use of the word item */
"Err257-R" = "To view or change permissions, select the item in the Finder and choose File > Get Info.";

/* NSFileReadNoPermissionError, argument is a file name */
"Err257.f" = "The file “%@” couldn’t be opened because you don’t have permission to view it.";

/* NSFileReadInvalidFileNameError */
"Err258-C" = "The file name is invalid.";

/* NSFileReadInvalidFileNameError, argument is a file or folder name */
"Err258.f" = "The item couldn’t be opened because the file name “%@” is invalid.";

/* NSFileReadCorruptFileError */
"Err259" = "The file couldn’t be opened because it isn’t in the correct format.";

/* NSFileReadCorruptFileError */
"Err259-C" = "The file isn’t in the correct format.";

/* NSFileReadCorruptFileError */
"Err259-R" = "The file might be corrupted, truncated, or in an unexpected format.";

/* NSFileReadCorruptFileError, argument is a file name */
"Err259.f" = "The file “%@” couldn’t be opened because it isn’t in the correct format.";

/* NSFileReadNoSuchFileError */
"Err260" = "The file couldn’t be opened because it doesn’t exist.";

/* NSFileReadNoSuchFileError */
"Err260(Folder).f" = "The folder “%@” doesn’t exist.";

/* NSFileReadNoSuchFileError */
"Err260-C" = "The file doesn’t exist.";

/* NSFileReadNoSuchFileError */
"Err260-C(Folder)" = "The folder doesn’t exist.";

/* NSFileReadNoSuchFileError, argument is a file name */
"Err260.f" = "The file “%@” couldn’t be opened because there is no such file.";

/* NSFileReadInapplicableStringEncodingError */
"Err261" = "The file couldn’t be opened using the specified text encoding.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-C" = "The specified text encoding isn’t applicable.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261-C.e" = "Text encoding %@ isn’t applicable.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-R" = "The file may have been saved using a different text encoding, or it may not be a text file.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.e" = "The file couldn’t be opened using text encoding %@.";

/* NSFileReadInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.ef" = "The file “%2$@” couldn’t be opened using text encoding %1$@.";

/* NSFileReadUnsupportedSchemeError */
"Err262" = "The file couldn’t be opened because the specified URL type isn’t supported.";

/* NSFileReadUnsupportedSchemeError */
"Err262-C" = "The specified URL type isn’t supported.";

/* NSFileReadUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err262.fu" = "The file “%1$@” couldn’t be opened because URL type %2$@ isn’t supported.";

/* NSFileReadUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err262.u" = "The file couldn’t be opened because URL type %@ isn’t supported.";

/* NSFileReadTooLargeError */
"Err263" = "The item couldn’t be opened because it is too large.";

/* NSFileReadTooLargeError, reason string */
"Err263-C" = "The item is too large.";

/* NSFileReadTooLargeError, argument is a file name */
"Err263.f" = "The item “%@” couldn’t be opened because it is too large.";

/* NSFileReadUnknownStringEncodingError */
"Err264" = "The file couldn’t be opened because the text encoding of the contents couldn’t be determined.";

/* NSFileReadUnknownStringEncodingError, reason string */
"Err264-C" = "The text encoding of the contents couldn’t be determined.";

/* NSFileReadUnknownStringEncodingError, recovery suggestion */
"Err264-R" = "You may be able to open the file by specifying a text encoding.";

/* NSFileReadUnknownStringEncodingError, argument is a file name */
"Err264.f" = "The file “%@” couldn’t be opened because the text encoding of its contents can’t be determined.";

/* NSUserCancelledError */
"Err3072-C" = "The operation was cancelled.";

/* NSFeatureUnsupportedError */
"Err3328" = "The requested operation couldn’t be completed because the feature is not supported.";

/* NSFeatureUnsupportedError, argument is a file name */
"Err3328(Trash).f" = "“%@” couldn’t be moved to the trash because the volume doesn’t have one.";

/* NSFeatureUnsupportedError, argument is a file name and volume name */
"Err3328(Trash).fv" = "“%1$@” couldn’t be moved to the trash because the volume “%2$@” doesn’t have one.";

/* NSFeatureUnsupportedError */
"Err3328-C" = "The requested operation is not supported.";

/* NSFeatureUnsupportedError */
"Err3328-C(Trash)" = "The volume doesn’t have a trash.";

/* NSPropertyListCorruptError */
"Err3840" = "The data couldn’t be read because it has been corrupted.";

/* NSPropertyListCorruptError */
"Err3840-C" = "The data has been corrupted.";

/* NSPropertyListUnknownVersionError */
"Err3841" = "The data couldn’t be read because it is in a format that this application doesn’t understand.";

/* NSPropertyListUnknownVersionError */
"Err3841-C" = "The data is in a format that this application doesn’t understand.";

/* NSPropertyListReadStreamError */
"Err3842" = "The data couldn’t be read because of an error in the source of the data.";

/* NSPropertyListReadStreamError */
"Err3842-C" = "An error occurred in the source of the data.";

/* NSPropertyListWriteStreamError */
"Err3851" = "The data couldn’t be written because of an error in the destination for the data.";

/* NSPropertyListWriteStreamError */
"Err3851-C" = "An error occurred in the destination for the data.";

/* NSFileNoSuchFileError, argument is a folder name */
"Err4(Folder).f" = "The folder “%@” doesn’t exist.";

/* NSFileNoSuchFileError, first arg: source file, second arg: destination file */
"Err4(Move).fp" = "“%1$@” couldn’t be moved to “%2$@” because either the former doesn't exist, or the folder containing the latter doesn't exist.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4(Remove).f" = "“%@” couldn’t be removed.";

/* NSFileNoSuchFileError */
"Err4-C" = "The file doesn’t exist.";

/* NSFileNoSuchFileError, applied to a folder */
"Err4-C(Folder)" = "The folder doesn’t exist.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4.f" = "The file “%@” doesn’t exist.";

/* Message shown when the connection to a helper application is interrupted due to the helper application exiting. */
"Err4097" = "Couldn’t communicate with a helper application.";

/* Recovery suggestion for message shown when the connection to a helper application is interrupted. */
"Err4097-R" = "Try your operation again. If that fails, quit and relaunch the application and try again.";

/* Message shown when the connection to a helper application is interrupted and can not be reestablished. */
"Err4099" = "Couldn’t communicate with a helper application.";

/* Recovery suggestion for message shown when the connection to a helper application is interrupted. */
"Err4099-R" = "Try your operation again. If that fails, quit and relaunch the application and try again.";

/* Message shown when the connection to a helper application is invalidated due to a corrupted response. */
"Err4101" = "Couldn’t communicate with a helper application.";

/* Recovery suggestion for message shown when the connection to a helper application is interrupted. */
"Err4101-R" = "Try your operation again. If that fails, quit and relaunch the application and try again.";

/* NSFileWriteUnknownError */
"Err512" = "The file couldn’t be saved.";

/* NSFileWriteUnknownError, when the save of the specified file fails because the backup file for the saved file can't be created or updated */
"Err512(Backup).f" = "The file “%1$@” couldn’t be saved because the backup file couldn’t be updated.";

/* NSFileWriteUnknownError, first argument is the source, second argument is the destination */
"Err512(Copy).fp" = "“%1$@” couldn’t be copied to “%2$@”.";

/* NSFileWriteUnknownError, first arg: source, second arg: destination */
"Err512(Link).fp" = "“%1$@” couldn’t be linked to “%2$@”.";

/* NSFileWriteUnknownError, first arg: source file, second arg: destination file */
"Err512(Move).fp" = "“%1$@” couldn’t be moved to “%2$@”.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Remove).f" = "“%@” couldn’t be removed.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Trash).f" = "“%@” couldn’t be moved to the trash.";

/* NSFileWriteUnknownError, when the save of a file fails because the backup file can't be created or updated */
"Err512-C(Backup)" = "The backup file couldn’t be saved.";

/* NSFileWriteUnknownError, recovery suggestion for when the save of a file fails because the backup file can't be created or updated */
"Err512-R(Backup)" = "The backup file might be locked, or you may not have permission to save it. To view or change permissions, select the item in the Finder and choose File > Get Info.";

/* NSFileWriteUnknownError, arguments are folder name where the file was going to be saved, and file name */
"Err512.df" = "The file “%2$@” couldn’t be saved in the folder “%1$@”.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512.f" = "The file “%@” couldn’t be saved.";

/* NSFileWriteNoPermissionError */
"Err513" = "The file couldn’t be saved because you don’t have permission.";

/* NSFileWriteNoPermissionError, first argument is the source, second argument is the destination */
"Err513(Copy).fp" = "“%1$@” couldn’t be copied because you don’t have permission to access “%2$@”.";

/* NSFileWriteNoPermissionError, first arg: source, second arg: destination */
"Err513(Link).fp" = "“%1$@” couldn’t be linked because you don’t have permission to access “%2$@”.";

/* NSFileWriteNoPermissionError, first arg: source file, second arg: destination file */
"Err513(Move).fp" = "“%1$@” couldn’t be moved because you don’t have permission to access “%2$@”.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Remove).f" = "“%@” couldn’t be removed because you don’t have permission to access it.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Trash).f" = "“%@” couldn’t be moved to the trash because you don’t have permission to access it.";

/* NSFileWriteNoPermissionError */
"Err513-C" = "You don’t have permission.";

/* NSFileWriteNoPermissionError; suggestion applies to files or folders, hence the use of the word item */
"Err513-R" = "To view or change permissions, select the item in the Finder and choose File > Get Info.";

/* NSFileWriteNoPermissionError, arguments are folder name where the file was going to be saved, and file name */
"Err513.df" = "You don’t have permission to save the file “%2$@” in the folder “%1$@”.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513.f" = "You don’t have permission to save the file “%@”.";

/* NSFileWriteInvalidFileNameError */
"Err514" = "The item couldn’t be saved because the file name is invalid.";

/* NSFileWriteInvalidFileNameError, argument is a file name */
"Err514(Remove).f" = "The item couldn’t be removed because the file name “%@” is invalid.";

/* NSFileWriteInvalidFileNameError */
"Err514-C" = "The file name is invalid.";

/* NSFileWriteInvalidFileNameError, argument is a file or folder name */
"Err514.f" = "The item couldn’t be saved because the file name “%@” is invalid.";

/* NSFileWriteFileExistsError */
"Err516" = "The file couldn’t be saved because a file with the same name already exists.";

/* NSFileWriteFileExistsError, first arg: source, second arg: destination */
"Err516(Copy).fp" = "“%1$@” couldn’t be copied to “%2$@” because an item with the same name already exists.";

/* NSFileWriteFileExistsError, first arg: source, second arg: destination */
"Err516(Link).fp" = "“%1$@” couldn’t be linked to “%2$@” because an item with the same name already exists.";

/* NSFileWriteFileExistsError, first arg: source, second arg: destination */
"Err516(Move).fp" = "“%1$@” couldn’t be moved to “%2$@” because an item with the same name already exists.";

/* NSFileWriteFileExistsError */
"Err516-C" = "A file with the same name already exists.";

/* NSFileWriteFileExistsError, argument is a file name */
"Err516-C.f" = "A file with the name “%@” already exists.";

/* NSFileWriteFileExistsError */
"Err516-R" = "To save the file, either provide a different name, or move aside or delete the existing file, and try again.";

/* NSFileWriteFileExistsError, first arg: destination folder, second arg: a file name */
"Err516.df" = "The file “%2$@” couldn’t be saved in the folder “%1$@” because a file with the same name already exists.";

/* NSFileWriteFileExistsError, argument is a file name */
"Err516.f" = "The file “%@” couldn’t be saved because a file with the same name already exists.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517" = "The file couldn’t be saved using the specified text encoding.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-C" = "The specified text encoding isn’t applicable.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517-C.e" = "Text encoding %@ isn’t applicable.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-R" = "If possible, select a different text encoding.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.e" = "The file couldn’t be saved using text encoding %@.";

/* NSFileWriteInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.ef" = "The file “%2$@” couldn’t be saved using text encoding %1$@.";

/* NSFileWriteUnsupportedSchemeError */
"Err518" = "The file couldn’t be saved because the specified URL type isn’t supported.";

/* NSFileWriteUnsupportedSchemeError */
"Err518-C" = "The specified URL type isn’t supported.";

/* NSFileWriteUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err518.fu" = "The file “%1$@” couldn’t be saved because URL type %2$@ isn’t supported.";

/* NSFileWriteUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err518.u" = "The file couldn’t be saved because URL type %@ isn’t supported.";

/* NSFileWriteOutOfSpaceError */
"Err640" = "The file couldn’t be saved because there isn’t enough space.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Copy).fp" = "“%1$@” couldn’t be copied to “%2$@” because there isn’t enough space.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Link).fp" = "“%1$@” couldn’t be linked to “%2$@” because there isn’t enough space.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Move).fp" = "“%1$@” couldn’t be moved to “%2$@” because there isn’t enough space.";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640(Trash).f" = "“%@” couldn’t be moved to the trash because there isn’t enough space.";

/* NSFileWriteOutOfSpaceError */
"Err640-C" = "There isn’t enough space.";

/* NSFileWriteOutOfSpaceError, argument is volume name */
"Err640-C.v" = "The volume “%@” is out of space.";

/* NSFileWriteOutOfSpaceError */
"Err640-R" = "Remove some files from the volume, and then try again.";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640.f" = "You can’t save the file “%@” because there isn’t enough space.";

/* NSFileWriteOutOfSpaceError, arguments are file name and volume name */
"Err640.fv" = "You can’t save the file “%1$@” because the volume “%2$@” is out of space.";

/* NSFileWriteVolumeReadOnlyError */
"Err642" = "The file couldn’t be saved because the volume is read only.";

/* NSFileWriteVolumeReadOnlyError, argument is a file name */
"Err642(Trash).f" = "“%@” couldn’t be moved to the trash because the volume is read only.";

/* NSFileWriteVolumeReadOnlyError */
"Err642-C" = "The volume is read only.";

/* NSFileWriteVolumeReadOnlyError, argument is volume name */
"Err642-C.v" = "The volume “%@” is read only.";

/* NSFileWriteVolumeReadOnlyError */
"Err642-R" = "Try saving the file to another volume.";

/* NSFileWriteVolumeReadOnlyError, argument is a file name */
"Err642.f" = "You can’t save the file “%@” because the volume is read only.";

/* NSFileWriteVolumeReadOnlyError, arguments are file name and volume name */
"Err642.fv" = "You can’t save the file “%1$@” because the volume “%2$@” is read only.";

/* A fallback error message. %@ is the error domain name, %ld is the error number */
"The operation couldn\\U2019t be completed. (%1$@ error %2$ld.)" = "The operation couldn’t be completed. (%1$@ error %2$ld.)";

